DataProcessors/ОтчетПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>ОтчетПоЗаказам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ОформлениеЗаявкиНаПроживание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ОформлениеЗаявкиНаПроживание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтчисленияСотрудникам</xr:Item>
				<xr:Item>InformationRegister.комнаты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Корпуса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПроживания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комната</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчисленияСотруднику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Организация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Организация</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОтчетПоЗаказам/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Создать(Команда)
    ТабДок = получитьОтчет();
	ТабДок.Показать();
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьОтчетЗаМесяц(Команда)
	ТабДок = получитьОтчетЗаМесяц(Объект.ДатаНачалаОтчета, Объект.ДатаОкончанияОтчета);
	ТабДок.Показать();	
КонецПроцедуры 

&НаСервере
Функция получитьОтчетЗаМесяц(ДатаНачала, ДатаОкончания)         
	Запрос1 = новый Запрос("ВЫБРАТЬ
	                       |	ОформлениеЗаявкиНаПроживание.Сотрудник КАК Сотрудник,
	                       |	ОформлениеЗаявкиНаПроживание.Клиент КАК Клиент,
	                       |	ОформлениеЗаявкиНаПроживание.КоличествоМесяцев КАК КоличествоМесяцев,
	                       |	ОформлениеЗаявкиНаПроживание.ОтчисленияСотруднику КАК ОтчисленияСотруднику,
	                       |	ОформлениеЗаявкиНаПроживание.МоментВремени КАК МоментВремени,
	                       |	ОформлениеЗаявкиНаПроживание.Комната КАК Комната,
	                       |	ОформлениеЗаявкиНаПроживание.СтоимостьПроживания КАК СтоимостьПроживания,
	                       |	Сотрудники.Должность КАК Должность
	                       |ИЗ
	                       |	Документ.ОформлениеЗаявкиНаПроживание КАК ОформлениеЗаявкиНаПроживание
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	                       |		ПО ОформлениеЗаявкиНаПроживание.Сотрудник = Сотрудники.Ссылка
	                       |ГДЕ
	                       |	ОформлениеЗаявкиНаПроживание.Дата >= &Дата
	                       |	И ОформлениеЗаявкиНаПроживание.Дата <= &ДатаОкончания");   
	
	Запрос1.УстановитьПараметр("Дата",ДатаНачала); 
	Запрос1.УстановитьПараметр("ДатаОкончания",ДатаОкончания); 
	Результат = Запрос1.Выполнить().Выбрать(); 
	ТабДок = новый ТабличныйДокумент();
	Макет1 = Объект.РеквизитМакет;
	ОбластьШапка = Макет1.ПолучитьОбласть("Шапка"); 
	
	Запрос2 = новый Запрос("ВЫБРАТЬ
	                       |	Организация.Наименование КАК Наименование,
	                       |	Организация.ЮридическийАдрес КАК ЮридическийАдрес,
	                       |	Организация.Телефон КАК Телефон,
	                       |	Организация.Почта КАК Почта,
	                       |	Организация.Сайт КАК Сайт
	                       |ИЗ
	                       |	Справочник.Организация КАК Организация");
	
	РезультатЗапроса = Запрос2.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Наименование = "";    
	Адрес = "";
	Телефон = "";
	Почта = "";
	Сайт = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	  Наименование = ВыборкаДетальныеЗаписи.Наименование;
	  Адрес = ВыборкаДетальныеЗаписи.ЮридическийАдрес;
	  Телефон = ВыборкаДетальныеЗаписи.Телефон;
	  Почта = ВыборкаДетальныеЗаписи.Почта;
	  Сайт = ВыборкаДетальныеЗаписи.Сайт;
	  
	КонецЦикла;
	
	//Результат2 = Запрос2.Выполнить();
	ОбластьШапка.Параметры.НазваниеОрганизации = Наименование;
	ОбластьШапка.Параметры.Адрес = Адрес;
	ОбластьШапка.Параметры.Телефон = Телефон;
	ОбластьШапка.Параметры.Почта = Почта;
	ОбластьШапка.Параметры.Сайт = Сайт;
	
    ТабДок.Вывести(ОбластьШапка);
	
	
	Прибыль = 0;                     	
	Пока Результат.Следующий() Цикл 
	ОбластьПараметры = Макет1.ПолучитьОбласть("Параметры");   
	ЗаполнитьЗначенияСвойств(ОбластьПараметры.Параметры,Результат);
	Прибыль = Прибыль + Результат.СтоимостьПроживания;
	ТабДок.Вывести(ОбластьПараметры);	
	КонецЦикла;           

	ОбластьПодвал = Макет1.ПолучитьОбласть("Подвал"); 
	ОбластьПодвал.Параметры.Прибыль = Прибыль;
	ТабДок.Вывести(ОбластьПодвал);	
	
	Возврат ТабДок;	
КонецФункции
Функция получитьОтчет()
	  Запрос1 = новый Запрос("ВЫБРАТЬ
	                         |	ОформлениеЗаявкиНаПроживание.Сотрудник КАК Сотрудник,
	                         |	ОформлениеЗаявкиНаПроживание.Клиент КАК Клиент,
	                         |	ОформлениеЗаявкиНаПроживание.КоличествоМесяцев КАК КоличествоМесяцев,
	                         |	ОформлениеЗаявкиНаПроживание.ОтчисленияСотруднику КАК ОтчисленияСотруднику,
	                         |	ОформлениеЗаявкиНаПроживание.МоментВремени КАК МоментВремени,
	                         |	ОформлениеЗаявкиНаПроживание.Комната КАК Комната,
	                         |	ОформлениеЗаявкиНаПроживание.СтоимостьПроживания КАК СтоимостьПроживания,
	                         |	Сотрудники.Должность КАК Должность
	                         |ИЗ
	                         |	Документ.ОформлениеЗаявкиНаПроживание КАК ОформлениеЗаявкиНаПроживание
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	                         |		ПО ОформлениеЗаявкиНаПроживание.Сотрудник = Сотрудники.Ссылка");
	
	Результат = Запрос1.Выполнить().Выбрать(); 
	ТабДок = новый ТабличныйДокумент();
	Макет1 = Объект.РеквизитМакет;
	ОбластьШапка = Макет1.ПолучитьОбласть("Шапка"); 
	
	Запрос2 = новый Запрос("ВЫБРАТЬ
	                       |	Организация.Наименование КАК Наименование,
	                       |	Организация.ЮридическийАдрес КАК ЮридическийАдрес,
	                       |	Организация.Телефон КАК Телефон,
	                       |	Организация.Почта КАК Почта,
	                       |	Организация.Сайт КАК Сайт
	                       |ИЗ
	                       |	Справочник.Организация КАК Организация");
	
	РезультатЗапроса = Запрос2.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Наименование = "";    
	Адрес = "";
	Телефон = "";
	Почта = "";
	Сайт = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	  Наименование = ВыборкаДетальныеЗаписи.Наименование;
	  Адрес = ВыборкаДетальныеЗаписи.ЮридическийАдрес;
	  Телефон = ВыборкаДетальныеЗаписи.Телефон;
	  Почта = ВыборкаДетальныеЗаписи.Почта;
	  Сайт = ВыборкаДетальныеЗаписи.Сайт;
	  
	КонецЦикла;
	
	//Результат2 = Запрос2.Выполнить();
	ОбластьШапка.Параметры.НазваниеОрганизации = Наименование;
	ОбластьШапка.Параметры.Адрес = Адрес;
	ОбластьШапка.Параметры.Телефон = Телефон;
	ОбластьШапка.Параметры.Почта = Почта;
	ОбластьШапка.Параметры.Сайт = Сайт;
	
    ТабДок.Вывести(ОбластьШапка);
	
	
	Прибыль = 0;                     	
	Пока Результат.Следующий() Цикл 
	ОбластьПараметры = Макет1.ПолучитьОбласть("Параметры");   
	ЗаполнитьЗначенияСвойств(ОбластьПараметры.Параметры,Результат);
	Прибыль = Прибыль + Результат.СтоимостьПроживания;
	ТабДок.Вывести(ОбластьПараметры);	
	КонецЦикла;           

	ОбластьПодвал = Макет1.ПолучитьОбласть("Подвал"); 
	ОбластьПодвал.Параметры.Прибыль = Прибыль;
	ТабДок.Вывести(ОбластьПодвал);	
	
	Возврат ТабДок;
	КонецФункции
